In [1]:
%matplotlib inline
import numpy as np
import pandas as pd

## Exercise 1
How likely is it that you roll doubles when rolling two dice?

In [2]:
die1 = np.random.choice([1, 2, 3, 4, 5, 6], 1_000_000)
die2 = np.random.choice([1, 2, 3, 4, 5, 6], 1_000_000)

In [3]:
doubles = die1 == die2
doubles

array([False, False, False, ..., False, False,  True])

In [4]:
doubles.mean()
#there is a 17% chance that you will roll doubles when rolling 2 dice

0.166666

## global variable n_trials

In [5]:
n_trials = 1_000_000

## Exercise 2
If you flip 8 coins, what is the probability of getting exactly 3 heads? What is the probability of getting more than 3 heads?

In [6]:
n_coins = 8

coins = np.random.choice([0, 1], size = (n_trials, n_coins)) 
coins = pd.DataFrame(coins)

In [7]:
coins.shape

(1000000, 8)

In [8]:
coins.head()

   0  1  2  3  4  5  6  7
0  1  0  1  1  0  0  1  1
1  1  1  0  0  1  1  0  0
2  0  1  1  0  1  1  0  0
3  1  1  1  0  0  0  1  1
4  1  1  1  0  0  0  0  1

In [9]:
coins['heads'] = coins.sum(axis = 1)

In [10]:
coins.head()

   0  1  2  3  4  5  6  7  heads
0  1  0  1  1  0  0  1  1      5
1  1  1  0  0  1  1  0  0      4
2  0  1  1  0  1  1  0  0      4
3  1  1  1  0  0  0  1  1      5
4  1  1  1  0  0  0  0  1      4

In [11]:
(coins.heads == 3).mean()
#there is a 22% probability you will get exactly 3 heads when you flip 8 coins

0.218017

In [12]:
(coins.heads > 3).mean()
#there is a 64% probability you will get more than 3 heads when you flip 8 coins

0.636746

## Exercise 3
There are approximitely 3 web development cohorts for every 1 data science cohort at Codeup. Assuming that Codeup randomly selects an alumni to put on a billboard, what are the odds that the two billboards I drive past both have data science students on them?

In [13]:
n_picks = 2

picks = np.random.choice([0, 1], p = [(3/4), (1/4)], size = (n_trials, n_picks))
picks = pd.DataFrame(picks)
picks

        0  1
0       0  0
1       0  0
2       1  0
3       0  0
4       0  0
...    .. ..
999995  0  0
999996  0  0
999997  0  0
999998  1  0
999999  0  1

[1000000 rows x 2 columns]

In [14]:
picks.sum(axis = 1) == 2

0         False
1         False
2         False
3         False
4         False
          ...
999995    False
999996    False
999997    False
999998    False
999999    False
Length: 1000000, dtype: bool

In [15]:
picks[picks.sum(axis = 1) == 2]

        0  1
25      1  1
67      1  1
73      1  1
122     1  1
127     1  1
...    .. ..
999924  1  1
999930  1  1
999956  1  1
999960  1  1
999972  1  1

[62113 rows x 2 columns]

In [16]:
picks[picks.sum(axis = 1) == 2].shape[0] / n_trials
#there is a 6% chance that both billboards feature a data scientist alumni

0.062113

In [17]:
#alternatively
picks['codeup'] = picks.sum(axis = 1)

In [18]:
picks.head()

   0  1  codeup
0  0  0       0
1  0  0       0
2  1  0       1
3  0  0       0
4  0  0       0

In [19]:
ds_prob = (picks.codeup == 2).mean()
odds = ds_prob / (1 - ds_prob)
1 / odds
#the odds are about 1 to 15 that both billboards will feature data science students

15.099689275996973

## Exercise 4
Codeup students buy, on average, 3 poptart packages with a standard deviation of 1.5 a day from the snack vending machine. If on monday the machine is restocked with 17 poptart packages, how likely is it that I will be able to buy some poptarts on Friday afternoon? (Remember, if you have mean and standard deviation, use the np.random.normal)

In [20]:
n_days = 5
consumed = np.random.normal(loc = 3, scale = 1.5, size = (n_trials, n_days)).astype(int)
consumed = pd.DataFrame(consumed)
consumed

        0  1  2  3  4
0       1  4  3  4  4
1       2  2  2  2  1
2       1  2  4  6  1
3       6  3  4  0  3
4       5  3  1  5  3
...    .. .. .. .. ..
999995  2  3  1  1  2
999996  3  1  1  0  3
999997  2  3  4  2  4
999998  3  6  3  5  2
999999  2  4  2  2  4

[1000000 rows x 5 columns]

In [21]:
consumed['poptarts_consumed'] = consumed.sum(axis = 1)
consumed.head()

   0  1  2  3  4  poptarts_consumed
0  1  4  3  4  4                 16
1  2  2  2  2  1                  9
2  1  2  4  6  1                 14
3  6  3  4  0  3                 16
4  5  3  1  5  3                 17

In [22]:
consumed.poptarts_consumed <= 16

0          True
1          True
2          True
3          True
4         False
          ...
999995     True
999996     True
999997     True
999998    False
999999     True
Name: poptarts_consumed, Length: 1000000, dtype: bool

In [23]:
(consumed.poptarts_consumed <= 16).mean()
#there is an 88% chance you will be able to buy poptarts on a Friday afternoon

0.878888

## Exercise 5 Compare Heights

Men have an average height of 178 cm and standard deviation of 8cm.
Women have a mean of 170, sd = 6cm.
Since you have means and standard deviations, you can use np.random.normal to generate observations.
If a man and woman are chosen at random, P(woman taller than man)?

In [24]:
man = np.random.normal(loc = 178, scale = 8, size = n_trials)
woman = np.random.normal(loc = 170, scale = 6, size = n_trials)
man = pd.DataFrame(man)
woman = pd.DataFrame(woman)
woman

                 0
0       164.562627
1       167.101314
2       176.528877
3       175.247318
4       173.851635
...            ...
999995  175.754538
999996  166.921903
999997  172.645953
999998  174.837404
999999  173.423055

[1000000 rows x 1 columns]

In [25]:
man

                 0
0       156.248485
1       171.885927
2       173.357306
3       168.236487
4       183.401569
...            ...
999995  191.055989
999996  194.649558
999997  175.903991
999998  188.981844
999999  178.907895

[1000000 rows x 1 columns]

In [26]:
man[0]

0         156.248485
1         171.885927
2         173.357306
3         168.236487
4         183.401569
             ...
999995    191.055989
999996    194.649558
999997    175.903991
999998    188.981844
999999    178.907895
Name: 0, Length: 1000000, dtype: float64

In [27]:
woman['man'] = man[0]

In [28]:
woman.head()

            0         man
0  164.562627  156.248485
1  167.101314  171.885927
2  176.528877  173.357306
3  175.247318  168.236487
4  173.851635  183.401569

In [29]:
women_taller_than_men = woman[0] > woman['man']
women_taller_than_men.mean()
#There is a 21% that a woman is taller than a man when both are chosen at random

0.211754

## Exercise 6
When installing anaconda on a student's computer, there's a 1 in 250 chance that the download is corrupted and the installation fails. What are the odds that after having 50 students download anaconda, no one has an installation issue? 100 students?

What is the probability that we observe an installation issue within the first 150 students that download anaconda?

How likely is it that 450 students all download anaconda without an issue?

In [30]:
n_students = 50
no_issues = np.random.choice([0, 1], p = [(249/250), (1/250)], size = (n_trials, n_students))
no_issues = pd.DataFrame(no_issues)

In [31]:
no_issues.sum(axis = 1) == 0

0         True
1         True
2         True
3         True
4         True
          ...
999995    True
999996    True
999997    True
999998    True
999999    True
Length: 1000000, dtype: bool

In [32]:
issue_rate = (no_issues.sum(axis = 1) == 0).mean()
#There is an 82% chance that there will be no issues if 50 students download anaconda
odds = issue_rate / (1 - issue_rate)
odds
#the odds that there will be no issues are about 9 to 2

4.492845568646839

In [33]:
n_students = 100
no_issues = np.random.choice([0, 1], p = [(249/250), (1/250)], size = (n_trials, n_students))
no_issues = pd.DataFrame(no_issues)

In [34]:
issue_rate = (no_issues.sum(axis = 1) == 0).mean()
#There is a 67% chance that there will be no issues if 100 students download anaconda
odds = issue_rate / (1 - issue_rate)
odds
#the odds that there will be no issues in 100 downloads are about 2 to 1

2.0288528522707314

In [35]:
n_students = 150
no_issues = np.random.choice([0, 1], p = [(249/250), (1/250)], size = (n_trials, n_students))
no_issues = pd.DataFrame(no_issues)

In [36]:
(no_issues.sum(axis = 1) > 0).mean()
#there is a 45 percent probability that there will be an issue within the first 150 downloads

0.451468

In [37]:
n_students = 450
no_issues = np.random.choice([0, 1], p = [(249/250), (1/250)], size = (n_trials, n_students))
no_issues = pd.DataFrame(no_issues)

In [38]:
(no_issues.sum(axis = 1) == 0).mean()
#there is a 17% chance there will be no issues if 450 students download anaconda

0.164679

## Exercise 7
There's a 70% chance on any given day that there will be at least one food truck at Travis Park. However, you haven't seen a food truck there in 3 days. How unlikely is this?

How likely is it that a food truck will show up sometime this week?

In [39]:
n_days = 3
food_truck = np.random.choice([0, 1], p = [(3/10), (7/10)], size = (n_trials, n_days))
food_truck = pd.DataFrame(food_truck)
food_truck

        0  1  2
0       1  1  1
1       1  0  1
2       0  0  1
3       1  1  1
4       1  1  1
...    .. .. ..
999995  1  0  1
999996  0  0  0
999997  1  0  1
999998  1  1  0
999999  1  1  1

[1000000 rows x 3 columns]

In [40]:
(food_truck.sum(axis = 1) == 0).mean()
#you have a 3% chance of seeing no food trucks in Travis park in 3 days

0.027363

In [41]:
n_days = 7
food_truck = np.random.choice([0, 1], p = [(3/10), (7/10)], size = (n_trials, n_days))
food_truck = pd.DataFrame(food_truck)
food_truck

        0  1  2  3  4  5  6
0       1  1  0  1  1  0  0
1       1  1  0  0  1  1  1
2       0  0  1  1  1  0  1
3       1  1  1  0  1  1  1
4       1  0  1  1  1  1  1
...    .. .. .. .. .. .. ..
999995  1  0  1  0  1  1  0
999996  1  1  0  1  1  1  1
999997  0  1  0  1  1  1  0
999998  0  0  1  1  1  0  1
999999  0  1  1  1  0  0  1

[1000000 rows x 7 columns]

In [42]:
(food_truck.sum(axis = 1) > 0).mean()
#There is a 100% chance that a food truck will show up sometime this week

0.999776

## Exercise 8
If 23 people are in the same room, what are the odds that two of them share a birthday? What if it's 20 people? 40?

In [43]:
n_peeps = 23
birthdays = np.random.choice(list(range(366)), size = (n_trials, n_peeps))
birthdays = pd.DataFrame(birthdays)
birthdays

,0,1,2,3,4,5,6,7,8,9,...,13,14,15,16,17,18,19,20,21,22
0,148,271,350,271,9,230,335,303,30,21,...,185,46,207,221,93,275,88,331,319,71
1,133,327,247,2,150,221,179,81,258,2,...,191,240,255,309,252,99,188,52,353,90
2,324,138,205,200,102,316,262,7,159,223,...,212,62,234,90,13,322,293,168,70,249
3,335,166,131,175,68,205,346,56,361,157,...,279,134,32,129,243,198,188,241,204,82
4,57,272,49,15,320,226,196,229,199,93,...,16,290,42,329,73,271,152,166,273,130
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999995,307,229,155,308,358,41,166,53,21,17,...,192,71,119,53,214,195,67,229,253,100
999996,259,242,244,271,153,49,9,19,230,53,...,337,286,45,255,231,24,23,27,204,68
999997,252,285,39,225,16,173,140,239,343,73,...,251,109,63,270,362,34,329,32,39,267
999998,62,275,175,70,166,320,103,55,22,33,...,181,319,103,57,226,340,6,262,259,191
999999,34,36,271,20,284,204,41,279,220,326,...,30,14,318,81,122,107,116,279,339,112

In [44]:
birthdays.nunique(axis = 1) < 23

0          True
1          True
2          True
3         False
4          True
          ...
999995     True
999996    False
999997     True
999998     True
999999     True
Length: 1000000, dtype: bool

In [45]:
(birthdays.nunique(axis = 1) < 23).mean()
#there is a 51% chance of finding 2 people with the same birthday in the same room of 23 people 
#the odds that 2 people in the same room of 23 people share a birthday are 51 to 49 (about 1 to 1)

0.50591

In [46]:
n_peeps = 20
birthdays = np.random.choice(list(range(366)), size = (n_trials, n_peeps))
birthdays = pd.DataFrame(birthdays)

In [47]:
(birthdays.nunique(axis = 1) < 20).mean()
#the odds that 2 people in the same room of 20 people share a birthday are 41 to 59 (about 2 to 3)

0.410476

In [48]:
n_peeps = 40
birthdays = np.random.choice(list(range(366)), size = (n_trials, n_peeps))
birthdays = pd.DataFrame(birthdays)

In [49]:
(birthdays.nunique(axis = 1) < 40).mean()
#the odds that 2 people in the same room of 40 people share a birthday are 89 to 11 (about 9 to 1)

0.89013